# 2. Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив надо заполнить
# значениями 0, 3, 4, 5 (индексация начинается с нуля), т.к. именно в этих позициях первого массива стоят четные числа.


import random

size = 10

limit = 20

array = [random.randint(0, limit) for i in range(size)]

array_2 = []
# print(array)

for i, v in enumerate(array):
    if v % 2 == 0:
        array_2.append(i)
print(array_2)
